{
  "backend/main.mo": "Defines core types and state for products, orders, translations, agents, and includes authorization mixin for the backend canister.",
  "feature_evidence.json": "Provides feature evidence metadata linking features to affected frontend files and related components.",
  "frontend-file-summaries.txt": "Lists short textual summaries for many frontend source files for reference or documentation.",
  "frontend/index.css": "Configures Tailwind base styles, theme variables, and dark mode CSS custom properties.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, app layout, i18n provider, and all admin/agent-protected routes.",
  "frontend/src/components/admin/AdminAuthControls.tsx": "Renders admin login/logout button with state from useAdminSession and i18n labels.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "Modal component for admin login handling username/password input and session actions.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin routes by checking authentication and showing an access denied UI with login modal if unauthenticated.",
  "frontend/src/components/agent/AgentLoginModal.tsx": "Login modal handling agent authentication with Internet Identity and credential checks, including error display and logout.",
  "frontend/src/components/agent/AgentRouteGuard.tsx": "Route guard that blocks access for unauthenticated agents and shows a login prompt modal.",
  "frontend/src/components/i18n/LanguageSelectModal.tsx": "Initial language selection modal shown once, allowing users to pick a preferred language.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Dropdown allowing users to switch the current app language.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout providing header, navigation, language switcher, footer, and admin/agent login modals.",
  "frontend/src/components/orders/OrderNowDialog.tsx": "Dialog offering website checkout or WhatsApp ordering options for a product.",
  "frontend/src/components/products/ProductImageGallery.tsx": "Image gallery with navigation arrows and thumbnails for browsing multiple product images.",
  "frontend/src/components/system/ErrorState.tsx": "Generic error display component with optional retry button.",
  "frontend/src/components/system/LoadingState.tsx": "Simple loading indicator showing a spinner and optional message.",
  "frontend/src/constants/categories.ts": "Defines allowed product categories and helper functions for labels and translation keys.",
  "frontend/src/constants/contact.ts": "Centralized contact details including phone, WhatsApp, address, and Google Maps links.",
  "frontend/src/hooks/admin/useAgents.ts": "Provides React Query hooks for CRUD operations on agents using the admin actor and session token.",
  "frontend/src/hooks/admin/useReferenceWebsite.ts": "Fetches and updates reference website data with public and admin actors.",
  "frontend/src/hooks/auth/useAdminSession.ts": "Manages admin login/logout with localStorage-backed session state and hardcoded credentials.",
  "frontend/src/hooks/auth/useAdminStatus.ts": "Exposes admin authentication status and token based on useAdminSession.",
  "frontend/src/hooks/auth/useAgentSession.ts": "Handles agent login/logout using actor methods, localStorage, and Internet Identity.",
  "frontend/src/hooks/auth/useUserProfile.ts": "Retrieves and saves the authenticated user's profile via actor methods.",
  "frontend/src/hooks/orders/useAgentOrders.ts": "Fetches orders assigned to the authenticated agent.",
  "frontend/src/hooks/orders/useCreateOrder.ts": "Creates a new customer order and refreshes order lists with notifications.",
  "frontend/src/hooks/orders/useOrders.ts": "Loads customer orders by status or all orders for admins using admin actor and token.",
  "frontend/src/hooks/orders/useUpdateOrderStatus.ts": "Updates order status as an admin and refreshes cached order data.",
  "frontend/src/hooks/products/useProductMutations.ts": "Provides admin mutations for creating, updating, and deleting products with cache invalidation.",
  "frontend/src/hooks/products/useProducts.ts": "Fetches products with language-aware transformations and category filtering.",
  "frontend/src/hooks/translations/useAboutUsTranslations.ts": "Loads and updates multilingual About Us content using public and admin actors.",
  "frontend/src/hooks/translations/useLandingPageTranslations.ts": "Gets and updates landing page translations based on language and admin access.",
  "frontend/src/hooks/translations/useProductTranslations.ts": "Updates per-language product name and description fields via the admin actor.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminActor.ts": "Creates an anonymous backend actor for admin-related operations using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout handling, and identity persistence via context.",
  "frontend/src/i18n/i18n.ts": "Defines supported languages, default language, and translation dictionaries for UI strings.",
  "frontend/src/i18n/I18nProvider.tsx": "Implements an i18n context provider handling current language, persistence, and translation lookup.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminAgentsPage.tsx": "Admin interface to create, edit, and delete agents with form validation and dialog-based CRUD actions.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard linking to management sections and displaying reference website info.",
  "frontend/src/pages/admin/AdminEditImagesPage.tsx": "Static admin page explaining that image management is not yet implemented.",
  "frontend/src/pages/admin/AdminEditTextPage.tsx": "Provides UI for editing hero, about, and product translation text across languages, using tabs and translation hooks.",
  "frontend/src/pages/admin/AdminGalleryPage.tsx": "Displays gallery section placeholder with notice that image management will be added later.",
  "frontend/src/pages/admin/OrderManagementPage.tsx": "Shows all orders with filters by product type and lets admins view and update order status.",
  "frontend/src/pages/admin/PlannedFeaturesPage.tsx": "Lists planned Phase 2 features with descriptions and shows completed Phase 1 features.",
  "frontend/src/pages/admin/ProductManagerPage.tsx": "Admin interface to add, edit, and delete products with translations, categories, pricing, and stock management.",
  "frontend/src/pages/admin/ReferenceWebsitePage.tsx": "Allows saving and editing a reference website URL and notes, with view and open-link functionality.",
  "frontend/src/pages/agent/AgentOrdersPage.tsx": "Displays a table of agent orders with loading/error states, using hooks to fetch orders and showing details like customer info, product, amount, and status.",
  "frontend/src/pages/CheckoutPage.tsx": "Displays a checkout form with validation, product info loading, and order creation logic.",
  "frontend/src/pages/ContactPage.tsx": "Renders contact details, phone and address cards, and an embedded map with fallback handling.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying hero text, features, category navigation, and WhatsApp contact actions with translation fallbacks.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product info including images, price, stock, and allows ordering or WhatsApp enquiries.",
  "frontend/src/pages/ProductListPage.tsx": "Lists products with category filtering, loading/error states, and product preview cards.",
  "frontend/src/utils/productType.ts": "Provides helpers to map product type enums and category strings to human‑readable labels and enum values.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/src/utils/validation.ts": "Contains simple form validation helpers for required fields, mobile numbers, pincodes, quantities, prices, and stock values.",
  "frontend/src/utils/whatsapp.ts": "Generates WhatsApp chat URLs and opens chats with a predefined message using the configured contact number.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, typography, and container settings, with plugins enabled for typography, container queries, and animations.",
  "project_state.json": "Tracks project scope, issues, design constraints, and feature requirements for ongoing development and fixes."
}