{
  "backend/main.mo": "Defines the main canister actor with product, order, translation, user profile, and reference website types plus storage maps and helper view converters.",
  "backend/migration.mo": "Migration script initializing the new referenceWebsite field to null.",
  "feature_evidence.json": "Feature evidence report listing features, involved files, components, and test IDs for reference website admin functionality.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for documentation or build planning.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styling tokens for the app.",
  "frontend/index.html": "Basic HTML entry point loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Sets up the React router, theme, i18n, and all public/admin routes including the new Reference Website admin page.",
  "frontend/src/components/admin/AdminAuthControls.tsx": "Admin login/logout button using Internet Identity with loading states and translation support.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "Modal dialog for admin authentication using Internet Identity with login/logout handling and UI copy.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Guards admin routes by checking admin status and showing a login modal or access denied state when needed.",
  "frontend/src/components/i18n/LanguageSelectModal.tsx": "Shows a modal prompting first‑time users to choose a language and saves their selection.",
  "frontend/src/components/i18n/LanguageSwitcher.tsx": "Provides a dropdown menu to switch the current app language.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with navigation, language switcher, and admin login modal.",
  "frontend/src/components/orders/OrderNowDialog.tsx": "Displays ordering options for a product, including website checkout and WhatsApp ordering.",
  "frontend/src/components/products/ProductImageGallery.tsx": "Provides an image gallery with navigation, thumbnails, and fallback states for product images.",
  "frontend/src/components/system/ErrorState.tsx": "Renders an error alert with optional retry action.",
  "frontend/src/components/system/LoadingState.tsx": "Shows a centered loading spinner with an optional message.",
  "frontend/src/constants/categories.ts": "Defines allowed product categories and helpers for labels and translation keys.",
  "frontend/src/hooks/admin/useReferenceWebsite.ts": "Fetches and saves the reference website configuration via actor calls.",
  "frontend/src/hooks/auth/useAdminStatus.ts": "Checks whether the current caller is an admin using actor queries.",
  "frontend/src/hooks/auth/useUserProfile.ts": "Loads and saves the current caller’s user profile through actor methods.",
  "frontend/src/hooks/orders/useCreateOrder.ts": "Creates a new customer order and handles success or error notifications.",
  "frontend/src/hooks/orders/useOrders.ts": "Retrieves orders by status or fetches all orders from the actor.",
  "frontend/src/hooks/orders/useUpdateOrderStatus.ts": "Updates an order’s status and refreshes related queries with notifications.",
  "frontend/src/hooks/products/useProductMutations.ts": "Creates, updates, and deletes products while invalidating product queries and showing toasts.",
  "frontend/src/hooks/products/useProducts.ts": "Fetches products with language-aware transformations and supports category filtering and lookup.",
  "frontend/src/hooks/translations/useLandingPageTranslations.ts": "Provides React Query hooks to fetch and update landing‑page translations via the backend actor, auto‑invalidating caches on update.",
  "frontend/src/hooks/translations/useProductTranslations.ts": "Defines a mutation hook to update product translations and invalidate the products query.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using Internet Identity, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing login, identity state, and error handling via Dfinity AuthClient.",
  "frontend/src/i18n/i18n.ts": "Defines supported languages, translation data, and helpers for retrieving and storing the current language.",
  "frontend/src/i18n/I18nProvider.tsx": "Provides language state, translation helper, and HTML lang syncing for the app.",
  "frontend/src/index.css": "Sets Tailwind base styles and defines light and dark CSS variables for theme colors.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Admin dashboard showing navigation cards and reference website info with an external link option.",
  "frontend/src/pages/admin/AdminEditImagesPage.tsx": "Static admin page placeholder for future image management functionality.",
  "frontend/src/pages/admin/AdminEditTextPage.tsx": "Admin interface for editing hero text and product translations across languages.",
  "frontend/src/pages/admin/AdminGalleryPage.tsx": "Placeholder admin page for future gallery management features.",
  "frontend/src/pages/admin/OrderManagementPage.tsx": "Displays all orders with loading/error states, tabbed views, and controls to view and update order status.",
  "frontend/src/pages/admin/PlannedFeaturesPage.tsx": "Shows a list of planned phase‑2 features with titles, descriptions, categories, and a summary of completed phase‑1 work.",
  "frontend/src/pages/admin/ProductManagerPage.tsx": "Provides a full CRUD interface for products, including listing, adding, editing, deleting, and validating product fields.",
  "frontend/src/pages/admin/ReferenceWebsitePage.tsx": "Allows admins to view, edit, and save a reference website URL and notes with persistence and validation.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements the checkout form, validates user input, creates orders, and displays loading or error states.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact information with an embedded Google Map and external map link using translations.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero section with translated text and category links using cards.",
  "frontend/src/pages/ProductDetailPage.tsx": "Displays detailed product info including images, pricing, stock, description, and an order dialog.",
  "frontend/src/pages/ProductListPage.tsx": "Lists products with category filtering, loading and error states, and product cards with basic details.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL parameters and session-based persisted parameters.",
  "frontend/src/utils/validation.ts": "Contains validation functions for required fields, mobile numbers, pincodes, quantities, prices, and stock values.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended color system using CSS variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, goals, issues, and feature list for phased development of an agricultural shop app with admin UI, multilingual support, and design constraints."
}