{
  "kind": "build_request",
  "title": "Add Reference Website URL capture for redesign matching a provided website",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-19",
      "text": "Add an admin-only feature to capture and persist a single “Reference Website” URL (the site the user wants to emulate) and optional design notes, so future UI work can explicitly target that reference.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am giving you a link to a website, can you make one like that?"
        ]
      },
      "acceptanceCriteria": [
        "A new admin-only page is available from the Admin Dashboard (and/or existing admin navigation) labeled in English as “Reference Website”.",
        "The page contains: (1) a required URL field, (2) an optional multi-line notes field, and (3) Save/Cancel actions.",
        "Saving persists the URL/notes in the backend canister and is only allowed for admins; non-admin callers are rejected.",
        "The saved URL is displayed on the page after reload and includes a safe “Open link” action that opens in a new tab.",
        "The page shows clear loading and error states and does not crash on backend failures."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Expose the saved Reference Website URL (read-only) somewhere in the existing admin area as a reminder for future redesign work (e.g., a small card/section on the Admin Dashboard or on the Planned Features page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "I am giving you a link to a website, can you make one like that?"
        ]
      },
      "acceptanceCriteria": [
        "When an admin has saved a Reference Website URL, the admin area shows the URL in a read-only display and provides an “Open link” action.",
        "If no Reference Website URL has been saved yet, the admin area shows a short English placeholder message indicating that the reference link has not been set.",
        "This display is not visible to non-admin users."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Only generate backend/migration.mo if state schema changes require conditional migration for existing deployments.",
    "Do not edit any frontend files under the immutablePaths listed in SYSTEM_CONTEXT.",
    "Do not introduce external databases or third-party auth; keep admin auth as currently implemented (Internet Identity-based).",
    "Use English for any new user-facing text introduced by this build request."
  ],
  "nonGoals": [
    "Do not implement the full visual redesign to match the reference website yet (that requires the actual URL and explicit design targets).",
    "Do not add image upload or scraping/crawling of the reference website.",
    "Do not change existing product, order, i18n, or admin-auth flows beyond adding this new reference-link capture/display."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}