{
  "kind": "build_request",
  "title": "Fix Google Map location and polish the Contact map section UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-44",
      "text": "Fix the Google Maps embed so it reliably points to the exact Rajdhani Beej Bhandar location using ONLY the provided location link (https://maps.app.goo.gl/1nXnfAyBe6BFAnA87), and ensure both the embedded map and the \"Open in Google Maps\" button open the same correct location (no wrong pin).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix map location and make it more professional and stylish"
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/constants/contact.ts, CONTACT_INFO.googleMapsLink remains exactly \"https://maps.app.goo.gl/1nXnfAyBe6BFAnA87\".",
        "CONTACT_INFO.googleMapsEmbedUrl is updated to a valid Google Maps embed URL that shows the correct Rajdhani Beej Bhandar location (not a placeholder/incorrect coordinates).",
        "On the Contact page, the iframe renders the correct location and the \"Open in Google Maps\" button opens the same correct location in a new tab.",
        "If the embed fails to load (blocked/invalid), the Contact page remains stable and usable (no crash), and the user still has a working \"Open in Google Maps\" link."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Make the Contact page map/location section look more professional and stylish while staying lightweight (no heavy animations), improving spacing, card treatment, and map frame presentation without changing the core content.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Fix map location and make it more professional and stylish"
        ]
      },
      "acceptanceCriteria": [
        "The map section on frontend/src/pages/ContactPage.tsx has improved visual polish (e.g., refined Card styling, better padding/typography hierarchy, tasteful border/shadow, consistent rounding) while remaining fast to render.",
        "The map iframe is presented in a cleaner frame (consistent rounded corners, subtle border/shadow) and maintains a responsive aspect ratio.",
        "User-facing text remains in English (existing i18n keys continue to be used; no new hardcoded non-English strings are introduced).",
        "No new heavy animation libraries/components are added; any motion is limited to subtle hover/focus states consistent with the existing Tailwind/shadcn styling."
      ]
    }
  ],
  "constraints": [
    "Use ONLY this provided Google Maps location link as the canonical location: https://maps.app.goo.gl/1nXnfAyBe6BFAnA87.",
    "Do not edit files under frontend/src/components/ui or any frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep changes lightweight and non-crashing; embed failures must not break page rendering."
  ],
  "nonGoals": [
    "Adding a new map provider (e.g., Mapbox) or any geolocation features.",
    "Implementing real-time directions, route planning, or location search.",
    "Backend changes (no Motoko changes required for this task)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}