{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Contact page Google Maps location and polish map section UI",
  "requirements": [
    {
      "id": "REQ-44",
      "summary": "Ensure the Google Maps embed and outbound link always open the exact Rajdhani Beej Bhandar location using the provided canonical Maps link, with a safe fallback if the embed fails.",
      "acceptanceCriteria": [
        "In frontend/src/constants/contact.ts, CONTACT_INFO.googleMapsLink remains exactly \"https://maps.app.goo.gl/1nXnfAyBe6BFAnA87\".",
        "CONTACT_INFO.googleMapsEmbedUrl is updated to a valid Google Maps embed URL that shows the correct Rajdhani Beej Bhandar location (not a placeholder/incorrect coordinates).",
        "On the Contact page, the iframe renders the correct location and the \"Open in Google Maps\" button opens the same correct location in a new tab.",
        "If the embed fails to load (blocked/invalid), the Contact page remains stable and usable (no crash), and the user still has a working \"Open in Google Maps\" link."
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/contact.ts",
          "operation": "modify",
          "description": "Update CONTACT_INFO.googleMapsEmbedUrl to a valid Google Maps embed URL that resolves to the same Rajdhani Beej Bhandar location as CONTACT_INFO.googleMapsLink, while keeping CONTACT_INFO.googleMapsLink exactly unchanged per constraints."
        },
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Harden the map embed rendering: add lightweight iframe error handling (no crashes on blocked/invalid embed) and ensure the outbound button uses CONTACT_INFO.googleMapsLink and an existing i18n key for its label so both map and button consistently target the same location."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Polish the Contact page map/location section styling with refined spacing, card treatment, and a cleaner responsive map frame while keeping content unchanged and lightweight.",
      "acceptanceCriteria": [
        "The map section on frontend/src/pages/ContactPage.tsx has improved visual polish (e.g., refined Card styling, better padding/typography hierarchy, tasteful border/shadow, consistent rounding) while remaining fast to render.",
        "The map iframe is presented in a cleaner frame (consistent rounded corners, subtle border/shadow) and maintains a responsive aspect ratio.",
        "User-facing text remains in English (existing i18n keys continue to be used; no new hardcoded non-English strings are introduced).",
        "No new heavy animation libraries/components are added; any motion is limited to subtle hover/focus states consistent with the existing Tailwind/shadcn styling."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ContactPage.tsx",
          "operation": "modify",
          "description": "Improve the map/location section UI using existing shadcn-ui primitives (Card/Button) and Tailwind utility classes only: enhance spacing and hierarchy, apply subtle border/shadow and consistent rounding, and present the iframe within a cleaner responsive frame with only minimal hover/focus states. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}